---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor(System.Boolean,System.Int32)
source: html/a4fb006b-c127-be82-cd36-ad3004b892ac.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.#ctor Method

Constructs an instance of settings with provided values.

## Syntax (C#)
```csharp
public DirectContext3DHandleSettings(
	bool visibility,
	int transparency
)
```

## Parameters
- **visibility** (`System.Boolean`) - Source visibility.
- **transparency** (`System.Int32`) - Source transparency.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is invalid. The valid range is 0 through 100